import { Answer } from "src/model/answer";
import { Question } from "src/model/question";

let questions1 = [
    new Question(1, "Для приготування страви «Голубці з м’ясом і рисом» використовують такий набір продуктів:", [
        new Answer("a)", "капуста білоголова свіжа, котлетне м’ясо, рис, цибуля ріпчаста, сало шпик, соус сметанний з томатом, часник", true),
        new Answer("б)", "рис, капуста білоголова свіжа, котлетне м’ясо, цибуля ріпчаста, петрушка, соус сметанний, часник", false),
        new Answer("в)", "капуста білоголова свіжа, рис, гриби білі сушені або гриби білі свіжі, цибуля ріпчаста, сало шпик, соус томатний", false),
    ]),
    new Question(2, "Для приготування страви «Голубці з м’ясом і рисом»  рис відварюємо:", [
        new Answer("a)", "10 хв.", false),
        new Answer("б)", "до напівготовності", true),
        new Answer("в)", "до готовності", false),
    ]),
    new Question(3, "Підготовка білогової капусти:", [
        new Answer("a)", "зачищають, промивають", false),
        new Answer("б)", "промивають, з середини видаляють качан", false),
        new Answer("в)", "зачищають, з середини видаляють качан і промивають", true),
    ]),
    new Question(4, "Що роблять з підготовленою капустою?", [
        new Answer("a)", "варять у воді до готовності, виймають, охолоджують, відокремлюють листки, зрізують або відбивають потовщення", false),
        new Answer("б)", "варять у підсоленій воді до напівготовності, виймають, дають стекти воді, охолоджують, відокремлюють листки", false),
        new Answer("в)", "варять у підсоленій воді до напівготовності, виймають, дають стекти воді, охолоджують, відокремлюють листки, зрізують або відбивають потовщення", true),
    ]),
    new Question(5, "Для приготування начинки:", [
        new Answer("a)", "м’ясо яловичини подрібнюють на м’ясорубці, додають розсипчасту, пасеровану на салі ріпчасту цибулю, сіль, мелений перець, перемішують", true),
        new Answer("б)", "м’ясо яловичини подрібнюють на м’ясорубці, додають сіль, мелений перець, перемішують", false),
        new Answer("в)", "м’ясо яловичини, додають розсипчасту, пасеровану на салі ріпчасту цибулю, сіль", false),
    ]),
    new Question(6, "Підготовлені напівфабрикати кладуть у сотейник, додають бульйон і припускають:", [
        new Answer("a)", "30-40 хв.", false),
        new Answer("б)", "1 год.", false),
        new Answer("в)", "5-10 хв.", true),
    ]),
    new Question(7, "Яким соусом заливають страву?", [
        new Answer("a)", "соусом сметанним з томатом", true),
        new Answer("б)", "сметанним соусом", false),
        new Answer("в)", "томатним соусом", false),
    ]),
    new Question(8, "Скільки хвилин потрібно тушкувати голубці?", [
        new Answer("a)", "50-60 хв.", false),
        new Answer("б)", "30 хв.", false),
        new Answer("в)", "10-15 хв.", true),
    ]),
    new Question(9, "Чим заправляють готові голубці?", [
        new Answer("a)", "томатною пастою", false),
        new Answer("б)", "часником", true),
        new Answer("в)", "сметаною", false),
    ]),
    new Question(10, "Скільки подається грам голубців на 1 порцію?", [
        new Answer("a)", "150", false),
        new Answer("б)", "275", true),
        new Answer("в)", "650", false),
    ])
];

let questions2 = [
    new Question(1, "Для приготування страви «Чорнослив фарширований горіхами» використовують такий набір продуктів:", [
        new Answer("a)", "Чорнослив, горіхи, цукрова пудра, шоколад", false),
        new Answer("б)", "Чорнослив, горіхи, цукор", false),
        new Answer("в)", "Чорнослив, горіхи, вершки або сметана, цукрова пудра, шоколад", true),
    ]),
    new Question(2, "Як обробляють чорнослив?", [
        new Answer("a)", "Перебирають, промивають, заливають гарячою перевареною водою і залишають до повного набухання і охолодження, видаляють кісточки", true),
        new Answer("б)", "Перебирають, заливають водою, залишають до повного набухання, видаляють кісточки", false),
        new Answer("в)", "Перебирають, промивають, видаляють кісточки", false),
    ]),
    new Question(3, "Який вид горіхів використовують у приготуванні цієї страви?", [
        new Answer("a)", "Арахіс", false),
        new Answer("б)", "Фундук", false),
        new Answer("в)", "Волоський", true),
    ]),
    new Question(4, "Перед фаршируванням горіхи обсмажують?", [
        new Answer("a)", "Ні", false),
        new Answer("б)", "Так", true)
    ]),
    new Question(5, "Скільки на порцію кладуть фаршированого чорносливу?", [
        new Answer("a)", "7 шт.", true),
        new Answer("б)", "4 шт.", false),
        new Answer("в)", "10 шт.", false),
    ]),
    new Question(6, "Термін зберігання готової страви?", [
        new Answer("a)", "48 год при температурі не вище від 6°C", false),
        new Answer("б)", "24 год при температурі не нище від 15°C", false),
        new Answer("в)", "36 год при температурі не вище від 6°C", true),
    ])
];

export { questions1, questions2 };